In [1]:
!pip install -q -U pandas

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv("dados/dataset1.csv")

### Methods e Atributos

In [5]:
df.shape

(615, 6)

In [7]:
df.size

3690

In [9]:
df.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [12]:
df.describe()

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [15]:
# describe para coluna
df.club.describe()

count     614
unique     23
top       VAN
freq       32
Name: club, dtype: object

In [16]:
df.value_counts()

club  last_name  first_name  position  base_salary  guaranteed_compensation
ATL   Almiron    Miguel      M         1912500.0    2297000.0                  1
ORL   Perez      Matias      F         260004.0     260004.0                   1
      Redding    Tommy       D         110000.0     117500.0                   1
      Rivas      Carlos      M         375000.0     375000.0                   1
      Rocha      Tony        M         65620.8      65620.8                    1
                                                                              ..
KC    Iwasa      Cameron     F         53004.0      53004.0                    1
      Juliao     Igor        D         100008.0     115008.0                   1
      Medranda   Jimmy       D         130008.0     130008.0                   1
      Melia      Tim         GK        165000.0     167500.0                   1
VAN   de Jong    Marcel      D-M       140000.0     140000.0                   1
Name: count, Length: 600, dtype: int64

In [18]:
# Método value_counts() para cada tipo de dado
df.dtypes.value_counts()

object     4
float64    2
Name: count, dtype: int64

In [20]:
# Método value_counts para cada coluna
df.club.value_counts()

club
VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
DAL      29
SJ       29
NYCFC    28
HOU      28
NYRB     28
TOR      27
RSL      27
POR      27
MTL      27
CHI      27
MNUFC    27
LA       27
DC       27
KC       26
COL      26
SEA      25
NE       23
LAFC      2
Name: count, dtype: int64

In [21]:
# Utilizar a função DatFrame() para criar dataframes a partir de conjuntos de dados
dados = [['a',1,1,0], ['b',0,0,1], ['c',1,1,1]]
df_teste = pd.DataFrame(dados)

In [22]:
df_teste.head()

   0  1  2  3
0  a  1  1  0
1  b  0  0  1
2  c  1  1  1